let data = {
    "table": "tf_event_master",
    "rows":
        [
            {
                "nm": "테스트_2019 대한펜싱협회 유소년 국가대표선수 선발전(여자 플러레)",
                "day": "2019-01-15-01-1",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "테스트_2019 대한펜싱협회 청소년 국가대표선수 선발전(여자 플러레)",
                "day": "2019-01-15-01-1",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 전국남녀종목별오픈펜싱선수권대회 겸 국가대표 선수 선발대회",
                "day": "2019-01-17-02-0",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "테스트대회",
                "day": "2019-02-14-02-1",
                "place": "",
                "etc": "참가"
            },
            {
                "nm": "2019 프랑스파리국제월드컵펜싱선수권대회",
                "day": "2019-01-10-01-1",
                "place": "프랑스/파리",
                "etc": "참가"
            },
            {
                "nm": "2019 일본도쿄국제월드컵펜싱선수권대회",
                "day": "2019-01-24-01-2",
                "place": "일본/도쿄",
                "etc": "참가"
            },
            {
                "nm": "2019 독일하이덴하임국제월드컵펜싱선수권대회",
                "day": "2019-01-09-01-0",
                "place": "독일/하이덴하임",
                "etc": "참가"
            },
            {
                "nm": "2019 카타르도하국제그랑프리펜싱선수권대회",
                "day": "2019-01-24-01-2",
                "place": "카타르/도하",
                "etc": "참가"
            },
            {
                "nm": "2019 하계유니버시아드대회 파견선수 선발전",
                "day": "2019-02-18-03-1",
                "place": "양구청춘체육관",
                "etc": "참가"
            },
            {
                "nm": "제48회 회장배전국남·녀종별펭신선수권대회",
                "day": "2019-02-21-03-1",
                "place": "전나람도 / 해남",
                "etc": "참가"
            },
            {
                "nm": "2019 폴란드카토비체국제월드컵펜싱선수권대회 ",
                "day": "2019-01-10-01-1",
                "place": "폴란드/카토비체",
                "etc": "참가"
            },
            {
                "nm": "2019 프랑스생모르국제월드컵펜싱선수권대회",
                "day": "2019-01-24-01-2",
                "place": "프랑스/생모르",
                "etc": "참가"
            },
            {
                "nm": "2019 미국솔트레이크시티국제월드컵펜싱선수권대회",
                "day": "2019-01-24-01-2",
                "place": "미국/솔트레이크시티",
                "etc": "참가"
            },
            {
                "nm": "2019 쿠바하바나국제월드컵펜싱선수권대회",
                "day": "2019-01-10-01-1",
                "place": "쿠바/하바나",
                "etc": "참가"
            },
            {
                "nm": "2019 카타르도하국제그랑프리펜싱선수권대회",
                "day": "2019-01-24-01-2",
                "place": "카타르/도하",
                "etc": "참가"
            },
            {
                "nm": "2019 이탈리아토리노국제그랑프리펜싱선수권대회",
                "day": "2019-02-07-02-0",
                "place": "이탈리아/토리노",
                "etc": "참가"
            },
            {
                "nm": "2019 캐나다벤쿠버국제월드컵펜싱선수권대회",
                "day": "2019-02-07-02-0",
                "place": "캐나다/벤쿠버",
                "etc": "참가"
            },
            {
                "nm": "2019 폴란드바르샤바국제월드컵펜싱선수권대회",
                "day": "2019-01-31-01-3",
                "place": "폴란드/바르샤바",
                "etc": "참가"
            },
            {
                "nm": "2019 이집트카이로국제그랑프리펜싱선수권대회",
                "day": "2019-02-21-02-2",
                "place": "이집트/카이로",
                "etc": "참가"
            },
            {
                "nm": "2019 스페인바르셀로나국제월드컵펜싱선수권대회",
                "day": "2019-02-07-02-0",
                "place": "스페인/바르셀로나",
                "etc": "참가"
            },
            {
                "nm": "2019 하계유니버시아드대회 파견선수 선발전(1차)",
                "day": "2019-03-07-03-1",
                "place": "양구청춘체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 하계유니버시아드대회 파견선수 선발전(2차)",
                "day": "2019-03-07-03-1",
                "place": "양구청춘체육관",
                "etc": "참가"
            },
            {
                "nm": "(테스트) 대회",
                "day": "2019-03-16-03-1",
                "place": "",
                "etc": "참가"
            },
            {
                "nm": "2019 하계유니버시아드대회 파견선수 선발전",
                "day": "2019-03-13-03-1",
                "place": "양구청춘체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 헝가리부다페스트국제월드컵펜싱선수권대회",
                "day": "2019-03-21-03-2",
                "place": "헝가리/부다페스트",
                "etc": "참가"
            },
            {
                "nm": "2019 아시아유소년펜싱선수권대회",
                "day": "2019-02-26-02-2",
                "place": "요르단/암만",
                "etc": "참가"
            },
            {
                "nm": "2019 아시아청소년펜싱선수권대회",
                "day": "2019-02-26-02-2",
                "place": "요르단/암만",
                "etc": "참가"
            },
            {
                "nm": "2019 이집트카이로국제월드컵펜싱선수권대회",
                "day": "2019-02-28-02-2",
                "place": "이집트/카이로",
                "etc": "참가"
            },
            {
                "nm": "2019 미국애너하임국제그랑프리펜싱선수권대회",
                "day": "2019-03-14-03-1",
                "place": "미국/애너하임",
                "etc": "참가"
            },
            {
                "nm": "2019 헝가리부다페스트국제그랑프리펜싱선수권대회",
                "day": "2019-03-07-03-0",
                "place": "헝가리/부다페스트",
                "etc": "참가"
            },
            {
                "nm": "2019 아르헨티나부에노스아이레스국제월드컵펜싱선수권대회",
                "day": "2019-03-21-03-2",
                "place": "아르헨티나/부에노스아이레스",
                "etc": "참가"
            },
            {
                "nm": "2019 중국청두국제월드컵펜싱선수권대회",
                "day": "2019-03-21-03-2",
                "place": "중국/청두",
                "etc": "참가"
            },
            {
                "nm": "2019 이탈리아파도바국제월드컵펜싱선수권대회",
                "day": "2019-03-07-03-0",
                "place": "이탈리아/파도바",
                "etc": "참가"
            },
            {
                "nm": "2019 그리스아테네국제월드컵펜싱선수권대회",
                "day": "2019-03-07-03-0",
                "place": "그리그/아테네",
                "etc": "참가"
            },
            {
                "nm": "2019 벨기에신트니클라스국제월드컵펜싱선수권대회",
                "day": "2019-03-21-03-2",
                "place": "벨기에/신트니클라스",
                "etc": "참가"
            },
            {
                "nm": "제48회 회장배전국남녀종별펜싱선수권대회",
                "day": "2019-03-25-03-2",
                "place": "해남우슬체육관",
                "etc": "참가"
            },
            {
                "nm": "제33회 문화체육관광부장관기전국체육고등학교체육대회",
                "day": "2019-04-16-04-1",
                "place": "동래중학교체육관",
                "etc": "참가"
            },
            {
                "nm": "제38회 한국대학펜싱연맹회장기 전국남녀대학펜싱선수권대회",
                "day": "2019-04-30-04-3",
                "place": "강원도/양구",
                "etc": "참가"
            },
            {
                "nm": "2019 펜싱 국가대표선수 선발대회 ",
                "day": "2019-05-03-05-2",
                "place": "나주종합스포츠파크다목적체육관 ",
                "etc": "참가"
            },
            {
                "nm": "제21회 한국실업펜싱연맹회장배전국남녀펜싱선수권대회",
                "day": "2019-04-10-04-1",
                "place": "화성펜싱전용경기장",
                "etc": "참가"
            },
            {
                "nm": "제48회 전국소년체육대회",
                "day": "2019-04-08-04-2",
                "place": "익산실내체육관",
                "etc": "참가"
            },
            {
                "nm": "제48회 전국소년체육대회_테스트대회",
                "day": "2019-05-16-05-1",
                "place": "익산실내체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 세계유소년펜싱선수권대회",
                "day": "2019-04-05-04-0",
                "place": "폴란드/토룬",
                "etc": "참가"
            },
            {
                "nm": "2019 세계청소년펜싱선수권대회",
                "day": "2019-04-05-04-0",
                "place": "폴란드/토룬",
                "etc": "참가"
            },
            {
                "nm": "제31회 한국중고펜싱연맹회장배전국남녀중고펜싱선수권대회",
                "day": "2019-04-16-04-1",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 러시아상트페테부르크국제월드컵펜싱선수권대회",
                "day": "2019-05-02-05-0",
                "place": "러시아/상트페테부르크",
                "etc": "참가"
            },
            {
                "nm": "2019 중국상하이국제그랑프리펜싱선수권대회",
                "day": "2019-05-15-05-1",
                "place": "중국/상하이",
                "etc": "참가"
            },
            {
                "nm": "2019 콜롬비아칼리국제그랑프리펜싱선수권대회",
                "day": "2019-05-02-05-0",
                "place": "콜롬비아/칼리",
                "etc": "참가"
            },
            {
                "nm": "2019 프랑스파리국제월드컵펜싱선수권대회",
                "day": "2019-05-16-06-1",
                "place": "프랑스/파리",
                "etc": "참가"
            },
            {
                "nm": "2019 SK텔레콤국제그랑프리펜싱선수권대회",
                "day": "2019-04-25-04-2",
                "place": "한국/서울",
                "etc": "참가"
            },
            {
                "nm": "2019 스페인마드리드국제월드컵펜싱선수권대회",
                "day": "2019-05-09-05-0",
                "place": "스페인/마드리드",
                "etc": "참가"
            },
            {
                "nm": "2019 러시아모스크바국제그랑프리펜싱선수권대회",
                "day": "2019-05-23-05-2",
                "place": "러시아/모스크바",
                "etc": "참가"
            },
            {
                "nm": "2019 독일타우버비쇼프스하임국제월드컵펜싱선수권대회",
                "day": "2019-05-02-05-0",
                "place": "독일/타우버비쇼프스하임",
                "etc": "참가"
            },
            {
                "nm": "2019 아랍에미레이트두바이국제월드컵펜싱선수권대회",
                "day": "2019-05-16-05-1",
                "place": "아랍에미레이트/두바이",
                "etc": "참가"
            },
            {
                "nm": "2019 튀니지튀니스국제월드컵펜싱선수권대회",
                "day": "2019-05-09-05-0",
                "place": "튀니지/튀니스",
                "etc": "참가"
            },
            {
                "nm": "2019 아시아펜싱선수권대회",
                "day": "2019-06-12-06-1",
                "place": "일본/도쿄",
                "etc": "참가"
            },
            {
                "nm": "2019 생활체육(클럽·동호인) 전국펜싱대회",
                "day": "2019-06-27-07-1",
                "place": "홍천종합체육관",
                "etc": "참가"
            },
            {
                "nm": "제59회 대통령배 전국남·녀펜싱선수권대회 겸 국가대표 선수 선발대회",
                "day": "2019-06-27-07-1",
                "place": "홍천종합체육관",
                "etc": "참가"
            },
            {
                "nm": "제47회 문화체육관광부장관기전국남녀중고펜싱선수권대회",
                "day": "2019-07-02-07-0",
                "place": "김천실내체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 하계유니버시아드대회",
                "day": "2019-07-03-07-0",
                "place": "이탈리아/나폴리",
                "etc": "참가"
            },
            {
                "nm": "제59회 대통령배 전국남녀펜싱선수권대회 겸 국가대표 선수 선발대회",
                "day": "2019-07-19-07-1",
                "place": "강원도 홍천군",
                "etc": "참가"
            },
            {
                "nm": "2019 FILA배 전국생활체육 동호인·클럽펜싱선수권대회 ",
                "day": "2019-07-22-08-1",
                "place": "홍천종합체육관",
                "etc": "참가"
            },
            {
                "nm": "제24회 김창환배전국남·녀펜싱선수권대회 겸 국가대표선수 선발대회",
                "day": "2019-07-22-08-0",
                "place": "홍천종합체육관",
                "etc": "참가"
            },
            {
                "nm": "제16회 한국중고펜싱연맹전국남녀종별펜싱선수권대회",
                "day": "2019-07-26-07-2",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 펜싱클럽 코리아 오픈대회",
                "day": "2019-08-05-08-2",
                "place": "화성종합경기타운실내체육관",
                "etc": "참가"
            },
            {
                "nm": "제57회 전국남녀종별펜싱선수권대회",
                "day": "2019-08-05-08-2",
                "place": "화성종합경기타운실내체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 세계펜싱선수권대회",
                "day": "2019-07-14-07-1",
                "place": "헝가리/부다페스트",
                "etc": "참가"
            },
            {
                "nm": "2019 태국오픈펜싱선수권대회",
                "day": "2019-09-09-09-0",
                "place": "태국/방콕",
                "etc": "참가"
            },
            {
                "nm": "제100회 전국체육대회",
                "day": "2019-09-18-09-1",
                "place": "한양대학교올림픽체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 제7회 대한펜싱협회장배 전국 클럽·동호인 펜싱선수권대회",
                "day": "2019-10-01-10-2",
                "place": "SK핸드볼경기장",
                "etc": "참가"
            },
            {
                "nm": "2019 싱가포르아시아까데서킷대회",
                "day": "2019-08-13-08-1",
                "place": "싱가포르",
                "etc": "참가"
            },
            {
                "nm": "2019 23세이하 아시아펜싱선수권대회",
                "day": "2019-10-22-10-2",
                "place": "태국/방콕",
                "etc": "참가"
            },
            {
                "nm": "제21회 전국남녀대학펜싱선수권대회",
                "day": "2019-11-18-11-1",
                "place": "우슬동백체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 프랑스오를레앙국제월드컵펜싱선수권대회",
                "day": "2019-11-22-11-2",
                "place": "프랑스/오를레앙",
                "etc": "참가"
            },
            {
                "nm": "2019 에스토니아탈린국제월드컵펜싱선수권대회",
                "day": "2019-11-01-11-0",
                "place": "에스토니아/탈린",
                "etc": "참가"
            },
            {
                "nm": "2019 이집트카이로국제월드컵펜싱선수권대회",
                "day": "2019-11-22-11-2",
                "place": "이집트/카이로",
                "etc": "참가"
            },
            {
                "nm": "2019 이집트카이로국제월드컵펜싱선수권대회",
                "day": "2019-11-15-11-1",
                "place": "이집트/카이로",
                "etc": "참가"
            },
            {
                "nm": "2019 스위스베른국제월드컵펜싱선수권대회",
                "day": "2019-11-22-11-2",
                "place": "스위스/베른",
                "etc": "참가"
            },
            {
                "nm": "2019 독일본국제월드컵펜싱선수권대회",
                "day": "2019-11-08-11-0",
                "place": "독일/본",
                "etc": "참가"
            },
            {
                "nm": "제7회 세계군인체육대회",
                "day": "2019-12-18-12-1",
                "place": "중국/우한",
                "etc": "참가"
            },
            {
                "nm": "2019 영국 런던 주니어 국제월드컵펜싱선수권대회",
                "day": "2019-11-01-11-0",
                "place": "영국/런던",
                "etc": "참가"
            },
            {
                "nm": "2019 태국방콕주니어국제월드컵펜싱선수권대회",
                "day": "2019-12-06-12-0",
                "place": "태국/방콕",
                "etc": "참가"
            },
            {
                "nm": "2020 대한펜싱협회 유소년 국가대표선수 선발전",
                "day": "2019-12-23-01-0",
                "place": "양구청춘체육관",
                "etc": "참가"
            },
            {
                "nm": "2019 일본도쿄국제월드컵펜싱선수권대회",
                "day": "2019-12-12-12-1",
                "place": "일본/도쿄",
                "etc": "참가"
            },
            {
                "nm": "2019 프랑스생모르국제월드컵펜싱선수권대회",
                "day": "2019-12-12-12-1",
                "place": "프랑스/생모르",
                "etc": "참가"
            },
            {
                "nm": "2019 미국솔트레이크시티국제월드컵펜싱선수권대회",
                "day": "2019-12-12-12-1",
                "place": "미국/솔트레이크시티",
                "etc": "참가"
            },
            {
                "nm": "2020 이탈리아우디네주니어국제월드컵펜싱선수권대회",
                "day": "2020-01-03-01-0",
                "place": "이탈리아/우디네",
                "etc": "참가"
            },
            {
                "nm": "2020 전국남녀종목별오픈펜싱선수권대회 겸 국가대표 선수 선발대회",
                "day": "2020-01-10-02-0",
                "place": "양구문화체육관",
                "etc": "참가"
            },
            {
                "nm": "2020 프랑스엑상프로방스주니어국제월드컵펜싱선수권대회",
                "day": "2020-01-16-01-1",
                "place": "프랑스/엑상프로방스",
                "etc": "참가"
            },
            {
                "nm": "2020 프랑스파리국제월드컵펜싱선수권대회",
                "day": "2020-01-09-01-0",
                "place": "프랑스/파리",
                "etc": "참가"
            },
            {
                "nm": "2020 독일하이덴하임국제월드컵펜싱선수권대회",
                "day": "2020-01-08-01-0",
                "place": "독일/하이덴하임",
                "etc": "참가"
            },
            {
                "nm": "2020 카타르도하국제그랑프리펜싱선수권대회",
                "day": "2020-01-23-01-2",
                "place": "카타르/도하",
                "etc": "참가"
            },
            {
                "nm": "2020 캐나다몬트리올국제그랑프리펜싱선수권대회",
                "day": "2020-01-09-01-0",
                "place": "캐나다/몬트리올",
                "etc": "참가"
            },
            {
                "nm": "2020 폴란드카토비체국제월드컵펜싱선수권대회",
                "day": "2020-01-09-01-0",
                "place": "폴란드/카토비체",
                "etc": "참가"
            },
            {
                "nm": "2020 쿠바하바나국제월드컵펜싱선수권대회",
                "day": "2020-01-09-01-0",
                "place": "쿠바/하바나",
                "etc": "참가"
            },
            {
                "nm": "2020 카타르도하국제그랑프리펜싱선수권대회",
                "day": "2020-01-23-01-2",
                "place": "카타르/도하",
                "etc": "참가"
            },
            {
                "nm": "2020 캐나다몬트리올국제그랑프리펜싱선수권대회",
                "day": "2020-01-09-01-0",
                "place": "캐나다/몬트리올",
                "etc": "참가"
            },
            {
                "nm": "2020 이탈리아토리노국제그랑프리펜싱선수권대회",
                "day": "2020-02-06-02-0",
                "place": "이탈리아/토리노",
                "etc": "참가"
            },
            {
                "nm": "2020 캐나다벤쿠버국제월드컵펜싱선수권대회",
                "day": "2020-02-06-02-0",
                "place": "캐나다/벤쿠버",
                "etc": "참가"
            },
            {
                "nm": "2020 이탈리아토리노국제그랑프리펜싱선수권대회",
                "day": "2020-02-06-02-0",
                "place": "이탈리아/토리노",
                "etc": "참가"
            }
        ]
    };

function getData(row){
    return data.rows.filter(function(e, i){  return i < row; })
}